tutorials/precice/volume_coupled/fl2/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 4;

method          simple;

coeffs
{
    n           (2 2 1);
}
